In [8]:
import pandas as pd
import numpy as np

from pandas import Series, DataFrame

In [2]:
ser1 = Series([1, 2, 3, 4], index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
ser2 = Series([5, 6, 7], index=['A', 'B', 'C'])
ser2

A    5
B    6
C    7
dtype: int64

In [6]:
ser1 + ser2 # adding 2 series together

A     6.0
B     8.0
C    10.0
D     NaN
dtype: float64

In [9]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['TOR', 'VAN']) #creating data frame using a shortcut to name columns

dframe1

     A  B
TOR  0  1
VAN  2  3

In [11]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['TOR', 'VAN', 'MTL'])
dframe2

     A  D  C
TOR  0  1  2
VAN  3  4  5
MTL  6  7  8

In [12]:
dframe1 + dframe2 # add 2 data frames together, then when it reaches a null value at a certain point, cells beyond will be null.

       A   B   C   D
MTL  NaN NaN NaN NaN
TOR  0.0 NaN NaN NaN
VAN  5.0 NaN NaN NaN

In [13]:
dframe1.add(dframe2, fill_value=0) # fill in the value 0 to replace the null values.

       A    B    C    D
MTL  6.0  NaN  8.0  7.0
TOR  0.0  1.0  2.0  1.0
VAN  5.0  3.0  5.0  4.0

In [17]:
ser3 = dframe2.loc['TOR'] # make a series that is based on an index in that is from dframe2
ser3

A    0
D    1
C    2
Name: TOR, dtype: int32

In [18]:
dframe2 - ser3 # subtract a dataframe by series

     A  D  C
TOR  0  0  0
VAN  3  3  3
MTL  6  6  6